package org.example;
// Часова складність:
// простий цикл від 2 до (n), де кожна ітерація виконується за фіксований час.
// Отже, часова складність цього алгоритму є O(n).

// Просторова складність:
// Для обчислення результату використовується постійна кількість змінних (a, b), незалежно від значення (n). Додаткова пам'ять не потрібна
// Отже, просторова складність - O(1).
public class FibonacciIterative {
    public static int fibonacci(int n) {
        if (n <= 0) {
            return 0;
        } else if (n == 1) {
            return 1;
        }
        int a = 0, b = 1;
        for (int i = 2; i <= n; i++) {
            int temp = a + b;
            a = b;
            b = temp;
        }
        return b;
    }

    public static void main(String[] args) {
        System.out.println(fibonacci(10)); // = 55
    }
}

//UML діаграма для ітеративного підходу:
/*
            [Start]
               |
      +------------------+
      | n <= 0? (Yes)    |
      | return 0         |
      +------------------+
               |
      +------------------+
      | n == 1? (Yes)    |
      | return 1         |
      +------------------+
               |
      +------------------+
      | Set a=0, b=1     |
      +------------------+
               |
      +------------------+
      | Loop (i=2 to n)  |
      | Update a, b      |
      +------------------+
               |
            [End]
 */
